/*
1. 자바에서 변수에 대한 설명 중 틀린 것은 무엇입니까?

답 : 4번/ 초기 값이 지정되지 않은 상태에서 읽어드리면 오류가 난다.

2. 변수 이름으로 사용 가능한 것을 모두 선택하세요?

답 : 1, 4, 5번/ 2번은 예약어, 3번은 숫자부터 시작, 6번은 예약어

3. 다음 표의 빈칸에 자바의 기본 타입 (Primitive Type) 8개를 적어보세요.

답 :

정수타입 byte(1byte), short(2byte), char(2byte), int(4byte), long(8byte)
실수타입 float(4byte), double(8byte)
논리타입 boolean

4. 다음 코드에서 타입, 변수 이름, 리터럴에 해당하는 것을 적어 보세요.

답 : 

타입 : int, double
변수 이름 : age, price
리터럴 : 10, 3.14

5. 자동 타입 변환에 대한 내용입니다. 컴파일 에러가 발생하는 것은 무엇입니까?

답 : 3번/ char타입을 short타입 하는 곳에서 오류 발생

6. 강제 타입 변환에 대 한 내용입니다. 컴파일 에러가 발생하는 것은 무엇입니까?

답 : 4번/ String은 클래스이기 때문에 char으로 변환 과정에서 오류가 발생함.

7. 변수를 잘못 초기화한 것은 무엇입니까?

답 : 5번/ float형이므로 10이 뒤에 f를 붙여 초기화해야 함

8.연산식에서의 타입 변환 내용입니다. 컴파일 에러가 생기는 것은 무엇입니까?

답 : 1번/ 피연산자의 경우 4byte를 차지하고 있으며 연산의 결과가 int형 이기 때문에 오류가 발생함

*/