/*
1. 연산자와 연산식에 대한 설명 중 틀린 것은 무엇입니까?

답 : 3번/ 연산자는 하나의 값만 산출한다.

2. 다음 코드를 실행했을 때 출력 결과는 무엇입니까?

답 : 31

3. 다음 코드를 실행했을 때 출력 결과는 무엇입니까?

답 : 가 / '90이상이 아니다' 가 true

4. 534자루의 연필을 30명의 학생들에게 똑같은 개수로 나누어 줄 때 학생당 몇 개를 가질 수 있고, 최종적으로
몇 개가 남는지를 구하는 코드입니다. ( #1 )과 ( #2 )에 들어갈 알맞은 코드를 작성하세요.

답 :

#1 => pencils / students
#2 => pencils % students

5. 다음은 십의 자리 이하를 버리는 코드입니다. 변수 value의 값이 356이라면 300이 나올 수 있도록
( #1 )에 알맞은 코드를 작성하세요.

#1 => value / 100 * 100

6. 다음 코드는 사다리꼴의 넓이를 구하는 코드입니다. 정확히 소수자릿수가 나올 수 있도록 알맞은 코드를
작성하세요.

#1 => (lengthTop + legnthBottom) * height / 2.0

7. 다음 코드는 비교 연산자와 논리 연산자의 복합 연산식입니다. 연산식의 출력 결과를 괄호 ( ) 속에
넣으세요.

답 : 

true
false

8. 다음은 % 연산을 수행한 결과값에 10을 더하는 코드입니다. NaN 값을 검사해서 올바른 결과가 출력될
수 있도록 ( #1 )에 들어갈 NaN을 검사하는 코드를 작성하세요.

답 :

Double.isNaN(z) / p.84 참고

*/

class Ch03
{
	public static void main(String [] args) {
		
	
	}
}