1. 객체와 클래스에 대한 설명으로 틀린 것은 무엇입니까?

답 : 3번 / 클래스의 객체는 하나가 아닌 여러 개 생성할 수 있다.



2. 클래스의 구성 멤버가 아닌 것은 무엇입니까?

답 : 4번 / 필드, 생성자, 메소드만 구성 멤버이다.




3. 필드, 생성자, 메소드에 대한 설명으로 틀린 것은 무엇입니까?

답 : 4번 / 반드시 필드나 메소드를 가질 필요는 없다.




4. 필드에 대한 설명으로 틀린 것은 무엇입니까?

답 : 3번 / 생성자 선언 후에 필드를 선언해도 된다.




5. 생성자에 대한 설명으로 틀린 것은 무엇입니까?

답 : 1번 / 생성자 호출은, 생성자를 만들지 않았더라도 자동으로 실행되기 때문에 반드시 필요한 것이다.




6. 메소드에 대한 설명으로 틀린 것은 무엇입니까?

답 : 4번 / 메소드의 이름은 같으나 인수의 개수나 타입이 다르면 여러개 생성할 수 있다.




7. 메소드 오버로딩에 대한 설명으로 틀린 것은 무엇입니까?

답 : 2번 / 리턴타입은 같아도 생성할 수 있으며, 타입이나 개수, 순서 중 하나만 다르면 여러 개 생성할 수 있다.




8. 인스턴스 멤버와 정적 멤버에 대한 설명으로 틀린 것은 무엇입니까?

답 : 2번 / 정적 멤버나 블록은 객체를 생성하지 않아도, 사용할 수 있기 때문에 인스턴스 필드에 대한 접근이 안 된다.




11. 접근 제한에 대한 설명으로 틀린 것은 무엇입니까?

답 : 3번 / default 접근 제한자는 같은 폴더 내에서 사용을 허가한다.




12. 다음 클래스에서 해당 멤버가 필드, 생성자, 메소드 중 어떤 것인지 빈칸을 채우세요.

답 : 필드, 생성자, 메소드