/*
   1. 성적표기능을 만들 클래스를 선언하고 메인메소드 작성한다.
   2. 메인메소드안에서 하는 일
       - 본인 이름(String)을 저장할 변수를 선언한다.
       - 국어(int),영어(int),수학(int) 점수(를 저장할 변수를 선언한다.
       - 총점(int), 평균(double), 학점(char)을 저장할 변수를 선언한다.

       - 선언된 국어, 영어, 수학 변수에
          45 ~ 100사이의 난수를 발생해서 점수를 저장한다.


       - 국어, 영어, 수학점수을 총점을 구하여 총점 변수에 저장한다.
       - 총점을 가지고 평균을 구하여 평균 변수에 저장한다.

       - 평균이 90이상이면 A , 
                80 ~ 89이면 B , 70 ~ 79이면 C
                60 ~ 69이면 D , 이외는 F
		소수점 한자리까지

		if구문, switch구문 두 개 동시에 해 보도록 한다.

        -평균은 소수점자리 한자리까지 출력한다.

       - 이름 , 국어점수, 영어점수, 수학점수, 총점,평균, 학점을 예쁘게 출력해본다.

*/
-------------------------------------
class ReportCard {
	public static void main(String [] args) {

	}
}






















