
   - 구구단 출력
   2중 for문 이용
   1~100까지 10행 10열로 출력 (for문 안에 for문 이용)
.  2중 for문을 이용해서 구구단을 출력(9행 8열)
    2 * 1 = 2     3*1=3    4*1=4 ......    9*1=9
    2 * 2 = 4     3*2=6
    2 * 3 = 6
    ...

   2 * 9 = 18 
   


-.교재 확인문제 풀기
  1) 60page -  ch02
  2) 102page - ch03
  3) 134page - ch04( 6번, 7번은 안합니다 반복문 예제는 for문으로 만들기)

*파일제출형식
  - 성적구하기,  구구단 :  exam폴더
  - 6번 확인문제 각 확인문제 chapter번호
   ex) ch02폴더, ch03폴더, ch04폴더
  - 별 문제는 star 폴더

  모든 폴더를 ex0126_본인이름.zip으로 압축해서
   8253jang@daum.net으로 <밤 12시까지> 제출해주세요